УТ.КонтурДиадок/src/DataProcessors/КонтурДиадокПеревозочныеДокументы/КонтурДиадокПеревозочныеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонтурДиадокПеревозочныеДокументы</name>
  <attributes>
    <name>РеквизитОбработки</name>
  </attributes>
  <tabularSections>
    <name>АктыОтметок</name>
    <attributes>
      <name>АктВзвешивания</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДопСведения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтороныСоставителиАктов</name>
    <attributes>
      <name>СторонаСоставитель</name>
      <type>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторАкта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОрганИсполнительнойВласти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрафыОтметок</name>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>База</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расчет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопИнформацияОтметок</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ.КонтурДиадок/src/DataProcessors/КонтурДиадокПеревозочныеДокументы/Forms/ФормаЭТрН_Титул3/Module.bsl
&НаСервере
Перем _ОбработкаОбъект;

&НаКлиенте
Перем _КлиентскиеВызовы;

&НаКлиенте
Перем _Платформа;

&НаСервере
Перем _МодульЯдроНаСервере;

#Область СлужебныеМетоды

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		Модуль_Ядро = Модуль_ЯдроНаСервере();
		_ОбработкаОбъект.ИнициализироватьМодуль(Модуль_Ядро); 
		
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Функция Модуль_Платформа() Экспорт
	
	Возврат _Платформа;
	
КонецФункции

&НаКлиенте
Функция Модуль_ЯдроНаКлиенте()
	
	Возврат _КлиентскиеВызовы.Модуль_ЯдроНаКлиенте();
	
КонецФункции

&НаСервере
Функция Модуль_ЯдроНаСервере() Экспорт
	
	Если _МодульЯдроНаСервере = Неопределено Тогда
		АдресОбработкиЯдра = СвойствоСтруктуры(ОбщийКонтекстКлиентСервер, "АдресОбработкиЯдра");
		
		Если ЗначениеЗаполнено(АдресОбработкиЯдра) Тогда
			_МодульЯдроНаСервере = ХранилищеОбработки_Прочитать(АдресОбработкиЯдра);
		КонецЕсли;
	КонецЕсли;
	
	Возврат _МодульЯдроНаСервере;
	
КонецФункции

&НаСервереБезКонтекста
Функция ХранилищеОбработки_Прочитать(АдресОбработки)
	
	СтруктураОбработки = ПолучитьИзВременногоХранилища(АдресОбработки);
	
	Результат = СвойствоСтруктуры(СтруктураОбработки, "ОбработкаОбъект");
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Перем Значение;
	
	Результат = ЗначениеПоУмолчанию;
	
	Если ЭтоСтруктура(Структура) И ЗначениеЗаполнено(Ключ) Тогда
		
		Если Структура.Свойство(Ключ, Значение) Тогда
			Результат = Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоСтруктура(Значение)
	
	Результат = Ложь;
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Структура")
		Или ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ИнициализацияФормы

&НаКлиенте
Процедура ИнициализироватьФорму(ФормаКлиентскиеВызовы, Модуль_Платформа) Экспорт
	
	_КлиентскиеВызовы = ФормаКлиентскиеВызовы;
	_Платформа = Модуль_Платформа;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбщийКонтекстКлиентСервер", ОбщийКонтекстКлиентСервер);
	Параметры.Свойство("Действие", Действие);
	Параметры.Свойство("ДокументЭТрН_Титул1", ДокументЭТрН_Титул1);
	Параметры.Свойство("kl_id", Значение_kl_id);
	
	BoxId = ДокументЭТрН_Титул1.Идентификаторы.BoxId;
	
	Ядро = Модуль_ЯдроНаСервере();
	
	ДокументЭТрН_Титул2 = Ядро.ПеревозочныеДокументы_Документ_ЭТрН_Титул2(BoxId, Значение_kl_id);
	
	УстановитьОграниченияТиповНаСервере();
	ВладелецПунктаВыгрузки = ДокументЭТрН_Титул1.Получатель.Организация;
	
	НастроитьЭлементыПриСозданииФормыНаСервере(Отказ);
	
	Метрики_ПриСозданииФормы();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыПриСозданииФормыНаСервере(Отказ)
	
	Ядро = Модуль_ЯдроНаСервере();
	
	ДействияЭДО = Ядро.Перечисление_ДействияЭДО();
	
	Если Действие = ДействияЭДО.ПодписатьВходящий Тогда
		
		ОтказВПриемке = Ложь;
		
	ИначеЕсли Действие = ДействияЭДО.ОтказатьВПодписи Тогда
		
		ОтказВПриемке = Истина;
		
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Элементы.ПредставлениеДокумента.Заголовок = ДокументЭТрН_Титул2.ИмяФайла;
	
	ЗаполнитьАдресВыгрузкиИзТитулаОснованияНаСервере();
	ЗаполнитьМетодыОпределенияМассыНаСервере();
	ЗаполнитьГрузыДляПеревозки();
	
	ОбщиеСведенияСостоянияГруза = "Без замечаний";
	
	ОбработатьОшибкиВалидацииДанныхНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьЭлементыПоРеквизитуОтказВПриемке();
	НастроитьЭлементыПоРеквизитуПринятьГрузПоПозициям();
	
КонецПроцедуры

#КонецОбласти

#Область ОсновныеДействияФормы

&НаКлиенте
Процедура НастроитьПараметрыПодписания(Команда)
	
	BoxId = ДокументЭТрН_Титул2.Идентификаторы.BoxId;
	
	Если ЗначениеЗаполнено(BoxId) Тогда
		
		Модуль_Платформа = Модуль_Платформа();
		ПараметрыОткрытия = Модуль_Платформа.ПараметрыФормыРедактированияПолномочий();
		
		ПараметрыОткрытия.АдресЯщика = BoxId;
		ПараметрыОткрытия.ТипКонтента = ТипКонтента_ЭТрН();
		ПараметрыОткрытия.ПокупательПродавец = "Продавец";
		ПараметрыОткрытия.ВидТитула = ВидТитула_ЭТрН();
		
		Модуль_Платформа.ОткрытьФормуДиадокМодальноЛок(
			"РедактированиеПолномочийУправляемая",
			ЭтаФорма,
			ПараметрыОткрытия);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьXML(Команда)
	
	ТесктXML = ПодготовитьXMLНаСервере();
	
	Если ТесктXML <> Неопределено Тогда
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(ТесктXML);
		ТекстовыйДокумент.Показать("Транспортная накладная (Титул Грузополучателя)");
		
		ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().ПоказатьЭТРН;
		Метрики_ПриВыполненииДействия(ДействиеМетрики);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьXMLНаСервере()
	
	МодульОбъекта = ОбработкаОбъект();
	
	ОбработатьОшибкиВалидацииДанныхНаСервере();
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		Результат = Неопределено;
	Иначе
		ПараметрыФормирования = ПараметрыФормированияТитулаНаСервере();
		Файл = МодульОбъекта.ЭТрН_Титул_3_КонтентXDTO(ПараметрыФормирования);
		Результат = МодульОбъекта.ТекстКонтентаXML(Файл);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПараметрыФормированияТитулаНаСервере()
	
	МодульОбъекта = ОбработкаОбъект();
	
	Результат = МодульОбъекта.Контракт_ДанныеЭТрН_Титул_3();
	
	Результат.ДокументЭТрН_Титул1 = ДокументЭТрН_Титул1;
	Результат.ДокументЭТрН_Титул2 = ДокументЭТрН_Титул2;
	
	Результат.ВладелецПунктаВыгрузки = ВладелецПунктаВыгрузки;
	Результат.АдресВыгрузки = ДанныеАдресаВыгрузки();
	Результат.ДатаПрибытияПлан = ДатаПрибытияПлан;
	Результат.ДатаПрибытияФакт = ДатаПрибытияФакт;
	Результат.ДатаУбытияФакт = ДатаУбытияФакт;
	Результат.КоличествоМест = КоличествоМест;
	Результат.МассаБрутто = МассаБрутто;
	Результат.МассаНетто = МассаНетто;
	Результат.МетодОпределенияМассы = МетодОпределенияМассы;
	Результат.ОбщиеСведенияСостоянияГруза = ОбщиеСведенияСостоянияГруза;
	Результат.Объем = Объем;
	Результат.ОтказВПриемке = ОтказВПриемке;
	Результат.ПринятьГрузПоПозициям = ПринятьГрузПоПозициям;
	Результат.ПринятьЧастично = ПринятьЧастично;
	Результат.ПричинаОтказа = ПричинаОтказа;
	
	ЗаполнитьТаблицуЗначенийПоИсточникуНаСервере(Результат.Грузы, Грузы);
	ЗаполнитьТаблицуЗначенийПоИсточникуНаСервере(Результат.Отметки, Отметки);
	ЗаполнитьТаблицуЗначенийПоИсточникуНаСервере(Результат.АктыОтметок, АктыОтметок);
	ЗаполнитьТаблицуЗначенийПоИсточникуНаСервере(Результат.СтороныСоставителиАктов, СтороныСоставителиАктов);
	ЗаполнитьТаблицуЗначенийПоИсточникуНаСервере(Результат.ШтрафыОтметок, ШтрафыОтметок);
	ЗаполнитьТаблицуЗначенийПоИсточникуНаСервере(Результат.ДопИнформацияОтметок, ДопИнформацияОтметок);
	ЗаполнитьТаблицуЗначенийПоИсточникуНаСервере(Результат.ДопИнформация, ДопИнформация);
	
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуЗначенийПоИсточникуНаСервере(Приемник, Источник)
	
	Для Каждого СтрокаТЗ Из Источник Цикл
		
		ЗаполнитьЗначенияСвойств(Приемник.Добавить(), СтрокаТЗ);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьИОтправитьИсходящий(Команда)
	
	Пакет = ПодготовитьПакетНаСервере();
	
	Если Пакет <> Неопределено Тогда
		
		Метрики_ПриОтправкеПакета();
		
		ОповещениеПослеОтправкиПакета = _Платформа.НовыйОписаниеОповещения("ПослеОтправкиПакета", ЭтаФорма);
		ПараметрыКоманды = _Платформа.ПараметрыКомандыДействияСПакетом(Пакет, ОповещениеПослеОтправкиПакета);
		
		_Платформа.ПодписатьИОтправитьИсходящийПакет(ПараметрыКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПослеОтправкиПакета(ПакетОтправлен, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ПакетОтправлен Тогда
		
		Состояние("ЭТрН-3 подписан и отправлен");
		ЭтаФорма.Закрыть(Истина);
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПодготовитьПакетНаСервере()
	
	МодульОбъекта = ОбработкаОбъект();
	
	ОбработатьОшибкиВалидацииДанныхНаСервере();
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		Результат = Неопределено;
	Иначе
		ПараметрыФормирования = ПараметрыФормированияТитулаНаСервере();
		Результат = МодульОбъекта.ЭТрН_Титул_3_ПакетДляОтправки(ПараметрыФормирования);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипКонтента_ЭТрН()
	
	Возврат "kl";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидТитула_ЭТрН()
	Возврат "LogisticsWaybill";
КонецФункции

&НаКлиенте
Процедура БаннерБольшеВозможностейТекстГиперссылкаНажатие(Элемент)
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().БольшеВозможностейЛогистики;
	Метрики_ПриВыполненииДействия(ДействиеМетрики);
	
	_КлиентскиеВызовы.ОткрытьСтраницуСИнформациейОМодулеЛогистики();
	
КонецПроцедуры

#КонецОбласти

#Область СтраницаОсновныеДанные

&НаСервере
Процедура ЗаполнитьМетодыОпределенияМассыНаСервере()
	
	МодульОбъекта = ОбработкаОбъект();
	
	МетодыОпределенияМассы = МодульОбъекта.ЭТрН_МетодыОпределенияМассы();
	
	Для Каждого ЭлементСписка Из МетодыОпределенияМассы Цикл
		Элементы.МетодОпределенияМассы.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАдресВыгрузкиИзТитулаОснованияНаСервере()
	
	МодульОбъекта = ОбработкаОбъект();
	
	АдресДоставкиЭТрН_Титул1 = МодульОбъекта.ЭТрН_Титул_3_ПредставлениеАдресаДоставкиТитулаОснования(ДокументЭТрН_Титул1);
	
	Если ЗначениеЗаполнено(АдресДоставкиЭТрН_Титул1) Тогда
		
		СписокВыбораАдреса = СписокВыбораАдреса();
		
		Для Каждого ЭлементСписка Из СписокВыбораАдреса Цикл
			Элементы.АдресВыгрузки.СписокВыбора.Добавить(ЭлементСписка);
		КонецЦикла;
		
		АдресВыгрузки = АдресДоставкиЭТрН_Титул1;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуВремяЗаявленноеТекущим(Команда)
	
	ДатаПрибытияПлан = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуВремяПрибытияТекущим(Команда)
	
	ДатаПрибытияФакт = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуВремяУбытияТекущим(Команда)
	
	ДатаУбытияФакт = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказВПриемкеПриИзменении(Элемент)
	
	НастроитьЭлементыПоРеквизитуОтказВПриемке();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПереченьГрузов(Команда)
	
	ЗаполнитьГрузыДляПеревозки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятьГрузПоПозициямПриИзменении(Элемент)
	
	НастроитьЭлементыПоРеквизитуПринятьГрузПоПозициям();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементыПоРеквизитуОтказВПриемке()
	
	Элементы.ПричинаОтказа.Видимость = ОтказВПриемке;
	Элементы.ПринятьЧастично.Видимость = НЕ ОтказВПриемке;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементыПоРеквизитуПринятьГрузПоПозициям()
	
	ЗаполнитьГрузыДляПеревозки();
	
	Если ПринятьГрузПоПозициям Тогда
		Элементы.СтраницаГрузы.Заголовок = "Грузы";
	Иначе
		Элементы.СтраницаГрузы.Заголовок = "Грузы (справочно)";
	КонецЕсли;
	
	Элементы.Грузы.ТолькоПросмотр = НЕ ПринятьГрузПоПозициям;
	Элементы.КоличествоМест.ТолькоПросмотр = ПринятьГрузПоПозициям;
	Элементы.МассаБрутто.ТолькоПросмотр = ПринятьГрузПоПозициям;
	Элементы.МассаНетто.ТолькоПросмотр = ПринятьГрузПоПозициям;
	Элементы.Объем.ТолькоПросмотр = ПринятьГрузПоПозициям;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();
	
	СписокВыбораАдреса = СписокВыбораАдреса();
	
	Для Каждого ЭлементСписка Из СписокВыбораАдреса Цикл
		
		Элемент.СписокВыбора.Добавить(ЭлементСписка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СписокВыбораАдреса()
	
	МодульОбъекта = ОбработкаОбъект();
	
	ДанныеАдресов = Новый Массив;
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(АдресДоставкиЭТрН_Титул1) Тогда
		
		Результат.Добавить(АдресДоставкиЭТрН_Титул1);
		
		ДанныеАдреса = МодульОбъекта.СтруктураАдреса();
		ДанныеАдреса.Адрес = АдресДоставкиЭТрН_Титул1;
		
		ДанныеАдреса.Вставить("ЭтоАдресИзЭТрН_Титул1", Истина);
		
		ДанныеАдресов.Добавить(ДанныеАдреса);
		
	КонецЕсли;
	
	КонтактнаяИнформация = МодульОбъекта.ДанныеКонтактнаяИнформацияАдреса(ВладелецПунктаВыгрузки);
	
	Для Каждого СтрокаАдреса Из КонтактнаяИнформация Цикл
		
		Адрес = СтрокаАдреса.Адрес;
		
		Если Результат.Найти(Адрес) = Неопределено Тогда
			
			Результат.Добавить(Адрес);
			
			ДанныеАдреса = МодульОбъекта.СтруктураАдреса();
			ЗаполнитьЗначенияСвойств(ДанныеАдреса, СтрокаАдреса);
			
			ДанныеАдреса.Вставить("ЭтоАдресИзЭТрН_Титул1", Ложь);
			
			ДанныеАдресов.Добавить(ДанныеАдреса);
			
		КонецЕсли; 
		
	КонецЦикла;
	
	АдресВыгрузкиХранение = ПоместитьВоВременноеХранилище(ДанныеАдресов, УникальныйИдентификатор);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДанныеАдресаВыгрузки()
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(АдресВыгрузкиХранение) Тогда
		
		ДанныеАдресов = ПолучитьИзВременногоХранилища(АдресВыгрузкиХранение);
		
		Для Каждого ДанныеАдреса Из ДанныеАдресов Цикл
			
			Если ДанныеАдреса.Адрес = АдресВыгрузки Тогда
				
				Результат = ДанныеАдреса;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СтраницаГрузы

&НаСервере
Процедура ЗаполнитьГрузыДляПеревозки()
	
	Грузы.Очистить();
	
	МодульОбъекта = ОбработкаОбъект();
	
	ГрузыДляПеревозки = МодульОбъекта.ЭТрН_Титул_3_ГрузыИзТитулаОснования(ДокументЭТрН_Титул1);
	
	Для Каждого ДанныеГруза Из ГрузыДляПеревозки Цикл
		
		СтрокаТЧ = Грузы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ДанныеГруза);
		
	КонецЦикла;
	
	КоличествоМест = Грузы.Итог("КоличествоМест");
	МассаБрутто = Грузы.Итог("МассаБрутто");
	МассаНетто = Грузы.Итог("МассаНетто");
	Объем = Грузы.Итог("Объем");
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	КоличествоМест = Грузы.Итог("КоличествоМест");
	МассаБрутто = Грузы.Итог("МассаБрутто");
	МассаНетто = Грузы.Итог("МассаНетто");
	Объем = Грузы.Итог("Объем");
	
КонецПроцедуры

#КонецОбласти

#Область СтраницаОтметки

&НаСервере
Процедура УстановитьОграниченияТиповНаСервере()
	
	МодульОбъекта = ОбработкаОбъект();
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(МодульОбъекта.СправочникТипОрганизации());
	МассивТипов.Добавить(МодульОбъекта.СправочникТипКонтрагенты());
	
	Элементы.ВладелецПунктаВыгрузки.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		Элемент.ТекущиеДанные.ИдентификаторОтметки = Элементы.Отметки.ТекущиеДанные.ИдентификаторСтроки;
		Элемент.ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтороныСоставителиАктовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		Элемент.ТекущиеДанные.ИдентификаторАкта = Элементы.АктыОтметок.ТекущиеДанные.ИдентификаторСтроки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрафыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		Элемент.ТекущиеДанные.ИдентификаторОтметки = Элементы.Отметки.ТекущиеДанные.ИдентификаторСтроки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДопИнформацияОтметокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		Элемент.ТекущиеДанные.ИдентификаторОтметки = Элементы.Отметки.ТекущиеДанные.ИдентификаторСтроки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = (Элементы.Отметки.ТекущиеДанные = Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СтороныСоставителиАктовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = (Элементы.АктыОтметок.ТекущиеДанные = Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрафыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = (Элементы.Отметки.ТекущиеДанные = Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ДопИнформацияОтметокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = (Элементы.Отметки.ТекущиеДанные = Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкиПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборПоОтметке();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьОтборПоОтметке();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоОтметке()
	
	ТекущиеДанныеОтметки = Элементы.Отметки.ТекущиеДанные;
	
	Если ТекущиеДанныеОтметки <> Неопределено
		И ЗначениеЗаполнено(ТекущиеДанныеОтметки.ИдентификаторСтроки) Тогда
		ИдентификаторОтметки = ТекущиеДанныеОтметки.ИдентификаторСтроки;
	Иначе
		ИдентификаторОтметки = ПустойИдентификатор();
	КонецЕсли;
	
	УстановитьОтборПоИдентификаторуОтметки(ИдентификаторОтметки);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоИдентификаторуОтметки(ИдентификаторОтметки)
	
	ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторОтметки", ИдентификаторОтметки);
	
	Элементы.АктыОтметок.ОтборСтрок = ОтборСтрок;
	Элементы.ШтрафыОтметок.ОтборСтрок = ОтборСтрок;
	Элементы.ДопИнформацияОтметок.ОтборСтрок = ОтборСтрок;

КонецПроцедуры

&НаКлиенте
Процедура АктыПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборПоАкту();
	
КонецПроцедуры

&НаКлиенте
Процедура АктыОтметокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьОтборПоАкту();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоАкту()
	
	ТекущиеДанныеАкта = Элементы.АктыОтметок.ТекущиеДанные;
	
	Если ТекущиеДанныеАкта <> Неопределено
		И ЗначениеЗаполнено(ТекущиеДанныеАкта.ИдентификаторСтроки) Тогда
		ИдентификаторАкта = ТекущиеДанныеАкта.ИдентификаторСтроки;
	Иначе
		ИдентификаторАкта = ПустойИдентификатор();
	КонецЕсли;
	
	УстановитьОтборПоИдентификаторуАкта(ИдентификаторАкта);

	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоИдентификаторуАкта(ИдентификаторАкта)
	
	ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторАкта", ИдентификаторАкта);
	
	Элементы.СтороныСоставителиАктов.ОтборСтрок = ОтборСтрок;

КонецПроцедуры

&НаКлиенте
Процедура ОтметкиПередУдалением(Элемент, Отказ)
	
	ИдентификаторСтроки = Элемент.ТекущиеДанные.ИдентификаторСтроки;
	
	ОтборСтрок = Новый Структура("ИдентификаторОтметки", ИдентификаторСтроки);
	
	СтрокиАктов = АктыОтметок.НайтиСтроки(ОтборСтрок);
	
	Для Каждого СтрокаАкта Из СтрокиАктов Цикл
		
		ОтборСтрокСоставителей = Новый Структура("ИдентификаторАкта", СтрокаАкта.ИдентификаторСтроки);
		УдалитьДанныеТЗ(СтороныСоставителиАктов, ОтборСтрокСоставителей);
		
	КонецЦикла;
	
	УдалитьДанныеТЗ(АктыОтметок, ОтборСтрок);
	УдалитьДанныеТЗ(ШтрафыОтметок, ОтборСтрок);
	УдалитьДанныеТЗ(ДопИнформацияОтметок, ОтборСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура АктыПередУдалением(Элемент, Отказ)
	
	ИдентификаторСтроки = Элемент.ТекущиеДанные.ИдентификаторСтроки;
	
	ОтборСтрок = Новый Структура("ИдентификаторАкта", ИдентификаторСтроки);
	
	УдалитьДанныеТЗ(СтороныСоставителиАктов, ОтборСтрок);
	
КонецПроцедуры

&НаКлиенте
Функция ПустойИдентификатор()
	
	Возврат "00000000-0000-0000-0000-000000000000";
	
КонецФункции

&НаКлиенте
Процедура УдалитьДанныеТЗ(ТЗ, ОтборСтрок)
	
	СтрокиТЗ = ТЗ.НайтиСтроки(ОтборСтрок);
	
	Для Каждого СтрокаТЗ Из СтрокиТЗ Цикл
		ТЗ.Удалить(СтрокаТЗ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОшибкиВалидации

&НаСервере
Процедура ОбработатьОшибкиВалидацииДанныхНаСервере()
	
	Ошибки.Очистить();
	
	ПараметрыФормирования = ПараметрыФормированияТитулаНаСервере();
	
	МодульОбъекта = ОбработкаОбъект();
	
	ОшибкиВалидацииДанных = МодульОбъекта.ЭТрН_Титул_3_ОшибкиВалидацииДанных(ПараметрыФормирования);
	
	Для Каждого ОписаниеОшибки Из ОшибкиВалидацииДанных Цикл
		
		ИмяРеквизита = ОписаниеОшибки.ИмяРеквизита;
		ИмяТабЧасти = ОписаниеОшибки.ИмяТабЧасти;
		ТекстОшибки = ОписаниеОшибки.ТекстОшибки;
		НомерСтроки = ОписаниеОшибки.НомерСтроки;
		
		СтрокаОшибки = Ошибки.Добавить();
		
		СтрокаОшибки.ИмяРеквизита = ИмяРеквизита;
		СтрокаОшибки.ИмяТабЧасти = ИмяТабЧасти;
		СтрокаОшибки.Представление = ПредставлениеРеквизитовДляОшибок(ТекстОшибки, ИмяРеквизита, ИмяТабЧасти);
		
		Если ЗначениеЗаполнено(ИмяТабЧасти) Тогда
			
			Если ИмяТабЧасти = "Отметки" Тогда
				СтрокаОшибки.Представление = СтрокаОшибки.Представление + " - строка " + НомерСтроки;
			КонецЕсли;
			
			СтрокаОшибки.ИдентификаторСтроки = ЭтаФорма[ИмяТабЧасти][НомерСтроки - 1].ПолучитьИдентификатор();
			
		КонецЕсли;
		
		СтрокаОшибки.ИдентификаторОтметки = ОписаниеОшибки.ИдентификаторОтметки;
		СтрокаОшибки.ИдентификаторАкта = ОписаниеОшибки.ИдентификаторАкта;
		
		СтрокаОшибки.ИндексКартинки = Истина;
		
	КонецЦикла;
	
	Элементы.ГруппаОшибки.Видимость = ЗначениеЗаполнено(Ошибки);
	
КонецПроцедуры

Функция ПредставлениеРеквизитовДляОшибок(ТекстОшибки, Знач ИмяРеквизита, ИмяТабЧасти)
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат ТекстОшибки;
	КонецЕсли;
	
	СлужебныеЗаголовкиРеквизитов = Новый Соответствие;
	
	СлужебныеЗаголовкиРеквизитов.Вставить("ДатаПрибытияПлан", "Заявленные дата и время прибытия под выгрузку");
	СлужебныеЗаголовкиРеквизитов.Вставить("ДатаПрибытияФакт", "Дата и время прибытия под выгрузку");
	СлужебныеЗаголовкиРеквизитов.Вставить("ДатаУбытияФакт", "Дата и время убытия");
	
	ПредставлениеРеквизита = СлужебныеЗаголовкиРеквизитов.Получить(ИмяРеквизита);
	
	Если НЕ ЗначениеЗаполнено(ПредставлениеРеквизита) Тогда
		
		Если ЗначениеЗаполнено(ИмяТабЧасти) Тогда
			ИмяРеквизита = ИмяТабЧасти + ИмяРеквизита;
		КонецЕсли;
		
		НайденныйЭлементФормы = Элементы.Найти(ИмяРеквизита);
		
		Если НайденныйЭлементФормы <> Неопределено Тогда
			ПредставлениеРеквизита = НайденныйЭлементФормы.Заголовок;
		Иначе
			ПредставлениеРеквизита = ИмяРеквизита;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = "Указать: " + ПредставлениеРеквизита;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура КомандаПроверитьНаличиеОшибок(Команда)
	
	ОбработатьОшибкиВалидацииДанныхНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОшибкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.ГиперссылкаЯчейки Тогда
		
		СтрокаОшибки = Элементы.Ошибки.ТекущиеДанные;
		
		Если ЗначениеЗаполнено(СтрокаОшибки.ИмяТабЧасти) Тогда
			
			Если ЗначениеЗаполнено(СтрокаОшибки.ИдентификаторОтметки) Тогда
				УстановитьОтборПоИдентификаторуОтметки(СтрокаОшибки.ИдентификаторОтметки);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаОшибки.ИдентификаторАкта) Тогда
				УстановитьОтборПоИдентификаторуАкта(СтрокаОшибки.ИдентификаторАкта)
			КонецЕсли;
			
			УстановитьТекущуСтрокуПоОтметке(СтрокаОшибки.ИдентификаторОтметки);
			УстановитьТекущуСтрокуПоАкту(СтрокаОшибки.ИдентификаторАкта);
			
			ЭтаФорма.ТекущийЭлемент = Элементы[СтрокаОшибки.ИмяТабЧасти];
			ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока = СтрокаОшибки.ИдентификаторСтроки;
			
		Иначе
			
			НайденныйЭлементФормы = Элементы.Найти(СтрокаОшибки.ИмяРеквизита);
			
			Если НайденныйЭлементФормы <> Неопределено Тогда
				ЭтаФорма.ТекущийЭлемент = НайденныйЭлементФормы;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущуСтрокуПоОтметке(ИдентификаторОтметки)
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторОтметки) Тогда
		Возврат;
	КонецЕсли;
	
	ОтборСтрок = Новый Структура("ИдентификаторСтроки", ИдентификаторОтметки);
	
	НайденныеСтроки = Отметки.НайтиСтроки(ОтборСтрок);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Элементы.Отметки.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущуСтрокуПоАкту(ИдентификаторАкта)
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторАкта) Тогда
		Возврат;
	КонецЕсли;
	
	ОтборСтрок = Новый Структура("ИдентификаторСтроки", ИдентификаторАкта);
	
	НайденныеСтроки = АктыОтметок.НайтиСтроки(ОтборСтрок);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		УстановитьТекущуСтрокуПоОтметке(НайденныеСтроки[0].ИдентификаторОтметки);
		Элементы.АктыОтметок.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Метрики

&НаСервере
Процедура Метрики_ПриСозданииФормы()
	
	BoxId = ДокументЭТрН_Титул1.Идентификаторы.BoxId;
	LetterId = ДокументЭТрН_Титул1.Идентификаторы.LetterId;
	DocumentId = ДокументЭТрН_Титул1.Идентификаторы.DocumentId;
	
	ДействиеМетрики = _ОбработкаОбъект.Метрика_НазваниеДействий().ОткрытиеФормыЭТРН;
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("kl_id", Значение_kl_id);
	ДопПеременные.Вставить("EtrnTitle", 3);
	ДопПеременные.Вставить("Title1_LetterId", LetterId);
	ДопПеременные.Вставить("Title1_DocumentId", DocumentId);
	
	ПредставлениеМетрики = Метрики_НаименованиеФормы();
	
	_ОбработкаОбъект.Метрика_ДобавитьСтатистику_ДляОрганизации(BoxId, ДействиеМетрики, ДопПеременные, ПредставлениеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрики_ПриОтправкеПакета()
	
	LetterId = ДокументЭТрН_Титул1.Идентификаторы.LetterId;
	DocumentId = ДокументЭТрН_Титул1.Идентификаторы.DocumentId;
	
	Если ОтказВПриемке Тогда
		Значение_Result = "Отказ";
	ИначеЕсли ПринятьЧастично Тогда
		Значение_Result = "Частичная приемка";
	Иначе
		Значение_Result = "Полная приемка";
	КонецЕсли;
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().ПодписатьИОтправить;
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("kl_id", Значение_kl_id);
	ДопПеременные.Вставить("EtrnTitle", 3);
	ДопПеременные.Вставить("Title1_LetterId", LetterId);
	ДопПеременные.Вставить("Title1_DocumentId", DocumentId);
	
	ДопПеременные.Вставить("Result", Значение_Result);
	
	Метрики_ПриВыполненииДействия(ДействиеМетрики, ДопПеременные);

КонецПроцедуры

&НаКлиенте
Процедура Метрики_ПриВыполненииДействия(ДействиеМетрики, ДопПеременные = Неопределено)
	
	BoxId = ДокументЭТрН_Титул1.Идентификаторы.BoxId;
	
	ПредставлениеМетрики = Метрики_НаименованиеФормы();
	
	_КлиентскиеВызовы.Метрика_ДобавитьПоведение_НажатиеКнопки(ПредставлениеМетрики, ДействиеМетрики, ПредставлениеМетрики);
	_КлиентскиеВызовы.Метрика_ДобавитьСтатистику_ДляОрганизации(BoxId, ДействиеМетрики, ДопПеременные, ПредставлениеМетрики);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция Метрики_НаименованиеФормы()
	
	Возврат "Транспортная накладная (Титул 3)";
	
КонецФункции

#КонецОбласти
